In [4]:
import pandas as pd
weather_data = {
    'Day': ['01/01/2017','01/02/2017','01/03/2017','01/04/2017','01/05/2017','01/06/2017'],
    'temprature': [32,35,28,24,32,31],
    'windspeed' : [6,7,2,7,4,2],
    'event': ['Rain', 'Sunny', 'Snow', 'Snow','Rain', 'Sunny']
}
df = pd.DataFrame(weather_data)
df

          Day  temprature  windspeed  event
0  01/01/2017          32          6   Rain
1  01/02/2017          35          7  Sunny
2  01/03/2017          28          2   Snow
3  01/04/2017          24          7   Snow
4  01/05/2017          32          4   Rain
5  01/06/2017          31          2  Sunny

In [6]:
df.shape

(6, 4)

In [7]:
rows, columns = df.shape
columns

4

In [8]:
rows, columns = df.shape
rows

6

In [57]:
# head(n) is used to return the first n rows of a dataset. By default, df.head() will return the first 5 rows of the DataFrame. 
# If you want more/less number of rows, you can specify n as an integer.
df.head(2)

          Day  temprature  windspeed  event
0  01/01/2017          32          6   Rain
1  01/02/2017          35          7  Sunny

In [13]:
df.tail(2)

          Day  temprature  windspeed  event
4  01/05/2017          32          4   Rain
5  01/06/2017          31          2  Sunny

In [15]:
df[2:5]

          Day  temprature  windspeed event
2  01/03/2017          28          2  Snow
3  01/04/2017          24          7  Snow
4  01/05/2017          32          4  Rain

In [16]:
df.columns

Index(['Day', 'temprature', 'windspeed', 'event'], dtype='object')

In [24]:
df['temprature'].max()

35

In [40]:
df[['Day','temprature']][df.temprature==df['temprature'].max()]

          Day  temprature
1  01/02/2017          35

In [26]:
# describe() lists out different descriptive statistical measures for all numerical columns in our dataset. 
# By assigning the include attribute the value ‘all’, we can get the description to include all columns, 
# including those containing categorical information.
df.describe()

       temprature  windspeed
count    6.000000   6.000000
mean    30.333333   4.666667
std      3.829708   2.338090
min     24.000000   2.000000
25%     28.750000   2.500000
50%     31.500000   5.000000
75%     32.000000   6.750000
max     35.000000   7.000000

In [58]:
# loc[:] helps to access a group of rows and columns in a dataset, a slice of the dataset, 
# as per our requirement. For instance, if we only want the last 2 rows and the first 3 columns of a dataset, 
# we can access them with the help of loc[:]. 
# We can also access rows and columns based on labels instead of row and column number.

df.loc[0:2]

          Day  temprature  windspeed  event
0  01/01/2017          32          6   Rain
1  01/02/2017          35          7  Sunny
2  01/03/2017          28          2   Snow

In [53]:
df.set_index('Day', inplace=True)

In [54]:
df.loc['01/02/2017']

temprature       35
windspeed         7
event         Sunny
Name: 01/02/2017, dtype: object

In [55]:
df.reset_index(inplace=True)

In [56]:
df

          Day  temprature  windspeed  event
0  01/01/2017          32          6   Rain
1  01/02/2017          35          7  Sunny
2  01/03/2017          28          2   Snow
3  01/04/2017          24          7   Snow
4  01/05/2017          32          4   Rain
5  01/06/2017          31          2  Sunny

In [59]:
# to_datetime() converts a Python object to datetime format. 
# It can take an integer, floating point number, list, Pandas Series, 
# or Pandas DataFrame as argument. to_datetime() is very powerful when the dataset has time series values or dates.
# data_1['DOB'] = pd.to_datetime(data_1['DOB'])
# The DOB column has now been changed to Pandas datatime format. All datetime functions can now be applied on this column.

In [ ]:
# drop_duplicates() returns a Pandas DataFrame with duplicate rows removed. 
# Even among duplicates, there is an option to keep the first occurrence (record) of the duplicate or the last. 
# You can also specify the inplace and ignore_index attribute. "data_1.drop_duplicates(inplace=True)"
# inplace=True makes sure the changes are applied to the original dataset. You can verify the changes 
# by looking at the shape of the original dataset, and the modified dataset (after dropping duplicates). 
# You will notice the number of rows have reduced from 9 to 8 
# (because 1 duplicate has been dropped).

In [ ]:
# groupby() is used to group a Pandas DataFrame by 1 or more columns, 
# and perform some mathematical operation on it. 
# groupby() can be used to summarize data in a simple manner.

In [ ]:
# merge() is used to merge 2 Pandas DataFrame objects or a DataFrame and a Series object on a common column (field). 
# If you are familiar with the concept of JOIN in SQL, merge function similar to that. It returns the merged DataFrame.

In [ ]:
# sort_values() is used to sort column in a Pandas DataFrame (or a Pandas Series) by values in ascending or descending order. 
# By specifying the inplace attribute as True, you can make a change directly in the original DataFrame.

In [ ]:
# fillna() Typically in a large dataset, you will find several entries labelled NaN by Python. NaN stands for “not a number”, 
# and represents entries that were not populated in the original data source. While populating the values in the DataFrame, 
# Pandas makes sure that these entries can be identified separately by the user.
# fillna() helps to replace all NaN values in a DataFrame or Series by imputing these missing values 
# with more appropriate values.  "data_1['City temp'].fillna(38.5, inplace=True)"
# The above code will replace all blank “City temp” entries with 38.5. 
# The missing values could be imputed with the mean, median, mode, or some other value. We have chosen mean for our case.